{
  "authors": [
    {
    "name"		: "Andrew Carr",
    "twitter"	: "@2metres",
    "avatar"	: "andrew-avatar.jpg"
  },
  {
    "name"		: "Ryan Boucher",
    "twitter"	: "@distributedlife",
    "avatar"	: "ryan-avatar.jpg"
  },
  {
    "name"		: "Mike Gardiner",
    "twitter"	: "@gardym",
    "avatar"	: "mike-avatar.jpg"
  }
  ],
  "title": "Continuous Design and the NoPSD Movement",
  "subtitle": "",
  "byline": "Ryan Boucher and Mike Gardiner",
  "issue": "Issue 02, July 2013",
  "issuelink": "index",
  "page": "4",
  "pagetotal": "7",
  "prev": "factory",
  "next": "improve-this",
  "paragraphs": [
    "I’m skyping with Andrew Carr when tells me about the NoPSD movement. A quick Google yields zero results. I could be onto something new here, or he could be another crackpot pushing GNU Hurd. This movement is using the pinnacle of graphics editing programs to push a new agenda in software design. Lately, Andrew finds that most of the styling he would normally do in Photoshop can be done using CSS3. It’s not the file format that’s the problem but what it represents: change is hard, so get it right the first time.",
    "There is a legacy process that sits behind the design methods we apply to software creation; most of it comes from traditional marketing and design.  It's an approach that's worked for creative agencies: magazines, TV advertisements, advertising campaigns – all these things are planned meticulously up front. In some cases, it's necessary – after all, it's harder to change an advertisement that's aired, or a magazine that's been printed then it is to change software.",
      "Most software design is still outsourced to firms who are traditionally marketing 'creative' companies. They're expensive, they'll deliver you a pixel-perfect layout of your entire application, and they'll charge you for it. It's what they know. \"But it's all just documentation, really.\" says Andrew, \"Comps, mockups, pitches, they're just requirements: visual documentation.\"",
        "What's worse is that we freeze this documentation as <b>The Final Design</b>, a canonical reference. Once that happens you stop talking about it, you stop challenging it or even being aware it needs adaptation. Worse still, there's a tendency to fall back to what you consider absolute, and the design starts driving the product. He sums it up: the accepted practice is not to redesign.",
    "Even some of the most successful Agile delivery teams are doing design the old fashioned way. Segmenting the design off as something that has to be done first. Only then do we shift into a happy Agile land. Wherein when we get feedback, we change and pivot on our product.  We need to pivot our design, too. When everything is designed up front, and we change – then the vestigial parts of the design become waste. We must be leaner.",
    {
      "blockquote": true,
      "text":"“We need to pivot our design”"
    },
    "Continuous Design is applying the same practices we use in writing software and product development, to design. \"It's coming from the same place as everything we do, it's just moving this approach into a new part of the development.\", Andrew says. \"It's about being involved in the whole process.\" Jeff Patton's lean approach to products talks about this: build the smallest thing you can as a base. Know you'll change it. Build it out over time. Stop when you've done enough.",
    "Andrew explains how he makes it work. He takes the prioritised features and creates a short buffer. Iteration Zero is the perfect time to build this design buffer. The design of the first story is little more than vague wireframes. He then works directly with the developers and the business.",
    "This is where using a more dynamic tool like HTML and CSS comes in; your designs become more adaptive to the changing product. As a designer you're no longer just projecting a good looking vision using Photoshop; you are involved in the development of the product.",
    "When the design comes over the wall you don't get to see what drove the existing design; why the original designer made the decisions they did. Without this information you may be doomed to repeat design dead-ends. By being involved in the entire process you know how the design got to where it was and are better able to adapt it to the situation as it changes.",
    "“When it comes to products, user experience trumps pretty pictures. It’s not easy to do for most designers to do, because you have to rebel against everything you’ve been taught as a designer: fight the pretty pictures, fight the urge to tweak your drop shadows or find the perfect border-radius.” Fast feedback is achieved by regularly putting things in front of users.",
      "Once you’ve broken your design mind of old habits you have to fight the establishment too, says Andrew. Often clients will ask for design work up front to get you to prove your worth. “I've had to do this on a few clients. It's like pitching your ability to do a project by <b>doing</b> a sample project, sometimes more. Can you imagine developers being asked to spike out a mainframe in two weeks so we can see what they’re made of?”",
        {
          "blockquote": true,
          "text": "There needs to be a revolution in the marketing world. It's such a bloated process, full of wasted energy."
        },
      "There needs to be a revolution in the marketing world. It's such a bloated process, full of wasted energy. It might work for selling billboards but it certainly doesn't work for building software. It promotes the same 'chuck it over the fence' mentality that we've fought between development to testers, and from testing to operations and production.",
      "When dealing with traditional creative agencies it’s a well known fact that designs will not go back once they are pronounced final because they are too expensive to re-engage. But by working with a an embedded designer in your project you'll find you will have a comparable dollar cost and a much better design because they will in the development team and do only what is needed.",
      "To rise to the challenge of Continuous Design you a need designer who is good at producing quality work quickly. There is a misconception that traditional designers can’t work quickly. This isn’t true at all, because the traditional marketing world has such a rapid pace of doing things anyway - receive a proposal on Thursday and pitch on Monday.",
      "Andrew says he’ll still do some sketching and Photoshop here and there, but it's for wireframing and layout, not for perfecting pixels. Just like the NoSQL movement was about using alternative data stores to support better data-modelling, the NoPSD movement is about alternatives that better support the real movement: Continuous Design."
  ]
}
